# Exercise

## Use this for the exercise

In [1]:
import pandas as pd

# Create a DataFrame from a dictionary
data = {
    'Name': ['John', 'Alice', 'Bob', 'Emily', 'David'],
    'Age': [30, 25, 35, 28, 32],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'San Francisco'],
    'Gender': ['M', 'F', 'M', 'F', 'M']
}
df = pd.DataFrame(data)

# Save DataFrame to a CSV file
df.to_csv('data.csv', index=False)


# Create a new DataFrame from a dictionary
new_data = {
    'Name': ['Michael', 'Sarah'],
    'Age': [41, 40],
    'City': ['Miami', 'Seattle'],
    'Gender': ['M', 'F']
}

## Question 1:

### How do you read a CSV file into a pandas DataFrame?

In [3]:
# To read a CSV file into pandas DataFrame, the syntax read_csv is use
df= pd.read_csv('data.csv')
df

    Name  Age           City Gender
0   John   30       New York      M
1  Alice   25    Los Angeles      F
2    Bob   35        Chicago      M
3  Emily   28        Houston      F
4  David   32  San Francisco      M

## Question 2:

### How do you select only specific columns from a DataFrame?

In [5]:
#to select column Name from the df 
df[['Name']]

    Name
0   John
1  Alice
2    Bob
3  Emily
4  David

## Question 3:

### How do you filter rows in a DataFrame based on a condition?

In [12]:
#Filering DataFrame on condition of Alice Name 
filtered = df[df['Name'] == 'Alice']
filtered

    Name  Age         City Gender
1  Alice   25  Los Angeles      F

## Question 4:

### How do you drop missing values (NaN) from a DataFrame?

In [ ]:
# Droping missing values is best used with function 
dataframe.dropna()

## Question 5:

### How do you merge two DataFrames in pandas?

In [25]:
#df2 = pd.DataFrame(new_data)
df3= pd.merge(df,df2, on= 'Name', how= 'outer',)
df3

      Name  Age_x         City_x Gender_x  Age_y   City_y Gender_y
0    Alice   25.0    Los Angeles        F    NaN      NaN      NaN
1      Bob   35.0        Chicago        M    NaN      NaN      NaN
2    David   32.0  San Francisco        M    NaN      NaN      NaN
3    Emily   28.0        Houston        F    NaN      NaN      NaN
4     John   30.0       New York        M    NaN      NaN      NaN
5  Michael    NaN            NaN      NaN   41.0    Miami        M
6    Sarah    NaN            NaN      NaN   40.0  Seattle        F

## Question 6:

### How do you create a new DataFrame from a dictionary?

In [ ]:
data = {
    'Name': ['Kay', 'Alice', 'Tani', 'Emily', 'David'],
    'Age': [30, 25, 35, 28, 32],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'San Francisco'],
    'Gender': ['M', 'F', 'M', 'F', 'M']
}
dataframe = pd.DataFrame(data)

## Question 7:

### How do you fill missing values in a DataFrame with a specific value?

In [ ]:
# We use forward fill to fill missing Values

## Question 8:

### How do you create a DataFrame from a CSV file with custom column names?

In [27]:
cus_column = pd.read_csv('data.csv', usecols=['Name'])
cus_column

    Name
0   John
1  Alice
2    Bob
3  Emily
4  David

## Question 9:

### How do you merge two DataFrames based on multiple columns?

In [29]:
df3= pd.merge(df,df2, on= ['Name','Age'] ,how= 'outer',)
df3

      Name  Age         City_x Gender_x   City_y Gender_y
0    Alice   25    Los Angeles        F      NaN      NaN
1      Bob   35        Chicago        M      NaN      NaN
2    David   32  San Francisco        M      NaN      NaN
3    Emily   28        Houston        F      NaN      NaN
4     John   30       New York        M      NaN      NaN
5  Michael   41            NaN      NaN    Miami        M
6    Sarah   40            NaN      NaN  Seattle        F

## Question 10:

### How do you perform an inner join between two DataFrames in pandas?

In [33]:
df2.join(df, how='inner',rsuffix='_right')

,Name,Age,City,Gender,Name_right,Age_right,City_right,Gender_right
0,Michael,41,Miami,M,John,30,New York,M
1,Sarah,40,Seattle,F,Alice,25,Los Angeles,F

## Question 11:

### How do you perform a left join between two DataFrames in pandas?

## Question 12:

### How do you perform a right join between two DataFrames in pandas?

## Question 13:

### How do you concatenate two DataFrames vertically in pandas?

## Question 14:

### How do you concatenate two DataFrames horizontally in pandas?

## Question 15:

### How do you group data in a DataFrame based on a column using the groupby function in pandas?